Revit 2026 API

# LineLoadSetCurve Method

---

Sets the curve for the line load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCurve(
	Curve curve
)
```
```vb
Public Sub SetCurve (
	curve As Curve
)
```
```cpp
public:
void SetCurve(
	Curve^ curve
)
```
```fsharp
member SetCurve :
        curve : Curve -> unit
```

#### Parameters

curve Curve

| Exception | Condition |
| --- | --- |
| ArgumentException | The input curve is not bound. -or- The provided curve is not supported. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This LineLoad is not a hosted load. -or- This LineLoad is a constrained load. |

The curve must be bounded. The curve can be:

  * Line
  * Arc
  * Ellipse

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace